In [4]:
import os
print(os.getcwd())
#os.chdir()

import pandas as pd
data = pd.read_csv("P4-Demographic-Data.csv")

/home/india/Documents/python/Python A-Z Udemy practice/4

In [8]:
data.columns = ["CountryName", "CountryCode", "BirthRate","InternetUsers","IncomeGroup"]
data.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

### Adding a Column
---

In [10]:
data["multiply"] = data[0:5]["BirthRate"]*data[0:5]["InternetUsers"]

In [29]:
data.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup,multiply
0,Aruba,ABW,10.244,78.9,High income,808.2516
1,Afghanistan,AFG,35.253,5.9,Low income,207.9927
2,Angola,AGO,45.985,19.1,Upper middle income,878.3135
3,Albania,ALB,12.877,57.2,Upper middle income,736.5644
4,United Arab Emirates,ARE,11.044,88.0,High income,971.8720

### Removing a column   press Shift + tab to get more details about a method

---

## data.drop(label, axis=0|1) 0 for Row, and 1 for Column

In [34]:
print(data.columns)
dropped = data.drop('multiply',axis=1)       #will not change the actual data until stored 
dropped.head()

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup', 'multiply'],
      dtype='object')

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

---

#### Filtering Data Set

---

In [49]:
# data = data.drop('multiply', axis=1)

#Filter by Internet
filterInternet = data.InternetUsers < 5

#Filter by Income
filterIncome = data.IncomeGroup=='Low income'

data[filterInternet]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
11,Burundi,BDI,44.151,1.3,Low income
13,Benin,BEN,36.440,4.9,Low income
29,Central African Republic,CAF,34.076,3.5,Low income
52,Eritrea,ERI,34.800,0.9,Low income
55,Ethiopia,ETH,32.925,1.9,Low income
64,Guinea,GIN,37.337,1.6,Low income
66,Guinea-Bissau,GNB,37.503,3.1,Low income
99,Liberia,LBR,35.521,3.2,Low income
111,Madagascar,MDG,34.686,3.0,Low income
115,Mali,MLI,44.138,3.5,Low income
117,Myanmar,MMR,18.119,1.6,Lower middle income
127,Niger,NER,49.661,1.7,Low income
154,Sierra Leone,SLE,36.729,1.7,Low income
156,Somalia,SOM,43.891,1.5,Low income
167,Chad,TCD,45.745,2.3,Low income
168,Togo,TGO,36.080,4.5,Low income
172,Timor-Leste,TLS,35.755,1.1,Lower middle income
177,Tanzania,TZA,39.518,4.4,Low income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income

## Mixing two filters

"filter1 and filter2" expects that filter1 and filter2 should return a single boolean value

"filter1 & filter2" is doing logical and

---

In [59]:
filter1 = data.IncomeGroup=='High income'
filter2 = data.InternetUsers<50
data[filter1 & filter2]

               CountryName CountryCode  BirthRate  InternetUsers  IncomeGroup
67       Equatorial Guinea         GNQ     35.362           16.4  High income
185  Virgin Islands (U.S.)         VIR     10.700           45.3  High income

### AND doesnt works on list

In [61]:
data[(data.BirthRate>40) & (data.InternetUsers<2)]

    CountryName CountryCode  BirthRate  InternetUsers IncomeGroup
11      Burundi         BDI     44.151            1.3  Low income
127       Niger         NER     49.661            1.7  Low income
156     Somalia         SOM     43.891            1.5  Low income

### Get the unique categories of data

In [66]:
cate = data.IncomeGroup.unique()
print(len(cate))
print(cate)

4
['High income' 'Low income' 'Upper middle income' 'Lower middle income']

In [67]:
data[data.CountryName =='Malta']

    CountryName CountryCode  BirthRate  InternetUsers  IncomeGroup
116       Malta         MLT        9.5        68.9138  High income

In [74]:
data[1:2].CountryName

1    Afghanistan
Name: CountryName, dtype: object

## Accessing a certain value or a field

---
### at() for non integer acccess, we dont need to count
### and iat() for accessing integer based index on the cell, count the positions and give the index
---

In [99]:
# data[3,4] gives an error
print(data.iat[0,1])
data.head()

ABW

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [101]:
#Using at() we have to give the label of row and columns
data.at[2, "InternetUsers"]

19.1

In [104]:
data20 = data[::20]

In [105]:
data20

    CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0         Aruba         ABW     10.244        78.9000          High income
20      Belarus         BLR     12.500        54.1700  Upper middle income
40   Costa Rica         CRI     15.022        45.9600  Upper middle income
60        Gabon         GAB     30.555         9.2000  Upper middle income
80        India         IND     20.291        15.1000  Lower middle income
100       Libya         LBY     21.425        16.5000  Upper middle income
120  Mozambique         MOZ     39.705         5.4000           Low income
140      Poland         POL      9.600        62.8492          High income
160    Suriname         SUR     18.455        37.4000  Upper middle income
180     Uruguay         URY     14.374        57.6900          High income

In [107]:
data20.iat[2,1] #iat is counting integers from rows and columns

'CRI'

In [110]:
data20.at[20,"CountryCode"] #at is refering labels from rows and columns

'BLR'